UsageError: Cell magic `%%sql` not found.

In [2]:
%load_ext sql

In [3]:
%sql sqlite://

In [4]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in c:\\users\\asus\\anacondadetails\\lib\\site-packages (0.5.0)',
 'Requirement already satisfied: ipython-genutils in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: sqlalchemy>=2.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (2.0.19)',
 'Requirement already satisfied: ipython in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (8.10.0)',
 'Requirement already satisfied: sqlparse in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (0.4.4)',
 'Requirement already satisfied: six in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (1.16.0)',
 'Requirement already satisfied: prettytable in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (3.8.0)',
 'Requirement already satisfied: greenlet!=0.4.17 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)',
 'Requirement already satisfied: typing-extensions>=4.2.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)',
 'Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (3.0.36)',
 'Requirement already satisfied: matplotlib-inline in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.1.6)',
 'Requirement already satisfied: backcall in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.2.0)',
 'Requirement already satisfied: colorama in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.4.6)',
 'Requirement already satisfied: decorator in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (5.1.1)',
 'Requirement already satisfied: pygments>=2.4.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (2.11.2)',
 'Requirement already satisfied: pickleshare in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.7.5)',
 'Requirement already satisfied: stack-data in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.2.0)',
 'Requirement already satisfied: jedi>=0.16 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.18.1)',
 'Requirement already satisfied: traitlets>=5 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (5.7.1)',
 'Requirement already satisfied: wcwidth in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from prettytable->ipython-sql) (0.2.5)',
 'Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)',
 'Requirement already satisfied: pure-eval in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)',
 'Requirement already satisfied: asttokens in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)',
 'Requirement already satisfied: executing in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)']

In [5]:
import pandas as pd
import sqlite3

In [6]:
%%sql 
CREATE TABLE Warehouses (
   Code INTEGER NOT NULL,
   Location VARCHAR(255) NOT NULL ,
   Capacity INTEGER NOT NULL,
   PRIMARY KEY (Code)
 );

 * sqlite://
Done.

[]

In [7]:
%%sql
CREATE TABLE Boxes (
    Code CHAR(4) NOT NULL,
    Contents VARCHAR(255) NOT NULL ,
    Value REAL NOT NULL ,
    Warehouse INTEGER NOT NULL,
    PRIMARY KEY (Code),
    FOREIGN KEY (Warehouse) REFERENCES Warehouses(Code)
 )

 * sqlite://
Done.

[]

In [8]:
%%sql
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(1,'Chicago',3);
 INSERT INTO Warehouses(Code,Location,Capacity) VALUES(2,'Chicago',4);
 INSERT INTO Warehouses(Code,Location,Capacity) VALUES(3,'New York',7);
 INSERT INTO Warehouses(Code,Location,Capacity) VALUES(4,'Los Angeles',2);
 INSERT INTO Warehouses(Code,Location,Capacity) VALUES(5,'San Francisco',8);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
select * from Warehouses;

 * sqlite://
Done.

[(1, 'Chicago', 3),
 (2, 'Chicago', 4),
 (3, 'New York', 7),
 (4, 'Los Angeles', 2),
 (5, 'San Francisco', 8)]

In [ ]:
--3.1 Select all warehouses.
--3.2 Select all boxes with a value larger than $150.
--3.3 Select all distinct contents in all the boxes.
--3.4 Select the average value of all the boxes.
--3.5 Select the warehouse code and the average value of the boxes in each warehouse.
--3.6 Same as previous exercise, but select only those warehouses where the average value of the boxes is greater than 150.
--3.7 Select the code of each box, along with the name of the city the box is located in.
--3.8 Select the warehouse codes, along with the number of boxes in each warehouse. 
    -- Optionally, take into account that some warehouses are empty (i.e., the box count should show up as zero, instead of omitting the warehouse from the result).
--3.9 Select the codes of all warehouses that are saturated (a warehouse is saturated if the number of boxes in it is larger than the warehouse's capacity).
--3.10 Select the codes of all the boxes located in Chicago.
--3.11 Create a new warehouse in New York with a capacity for 3 boxes.
--3.12 Create a new box, with code "H5RT", containing "Papers" with a value of $200, and located in warehouse 2.
--3.13 Reduce the value of all boxes by 15%.
--3.14 Remove all boxes with a value lower than $100.
-- 3.15 Remove all boxes from saturated warehouses.
-- 3.16 Add Index for column "Warehouse" in table "boxes"
    -- !!!NOTE!!!: index should NOT be used on small tables in practice
-- 3.17 Print all the existing indexes
    -- !!!NOTE!!!: index should NOT be used on small tables in practice
-- 3.18 Remove (drop) the index you added just
    -- !!!NOTE!!!: index should NOT be used on small tables in practice

In [9]:
%%sql
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('0MN7','Rocks',180,3);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4H8P','Rocks',250,1);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4RT3','Scissors',190,4);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('7G3H','Rocks',200,1);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8JN6','Papers',75,1);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8Y6U','Papers',50,3);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('9J6F','Papers',175,2);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('LL08','Rocks',140,4);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P0H6','Scissors',125,1);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P2T6','Scissors',150,2);
 INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('TU55','Papers',90,5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql
select * from Warehouses;

 * sqlite://
Done.

[(1, 'Chicago', 3),
 (2, 'Chicago', 4),
 (3, 'New York', 7),
 (4, 'Los Angeles', 2),
 (5, 'San Francisco', 8)]

In [21]:
%%sql
select * from Boxes

 * sqlite://
Done.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('8JN6', 'Papers', 75.0, 1),
 ('8Y6U', 'Papers', 50.0, 3),
 ('9J6F', 'Papers', 175.0, 2),
 ('LL08', 'Rocks', 140.0, 4),
 ('P0H6', 'Scissors', 125.0, 1),
 ('P2T6', 'Scissors', 150.0, 2),
 ('TU55', 'Papers', 90.0, 5)]

In [13]:
%%sql
select * from Boxes where value > 150;

 * sqlite://
Done.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('9J6F', 'Papers', 175.0, 2)]

In [14]:
%%sql
select distinct Contents from Boxes;

 * sqlite://
Done.

[('Rocks',), ('Scissors',), ('Papers',)]

In [15]:
%%sql
select avg(value) from Boxes;

 * sqlite://
Done.

[(147.72727272727272,)]

In [19]:


%%sql
select Warehouse, avg(value) from Boxes 
group by Warehouse

 * sqlite://
Done.

[(1, 162.5), (2, 162.5), (3, 115.0), (4, 165.0), (5, 90.0)]

In [25]:
%%sql
select Warehouse, avg(value) from Boxes
Group By Warehouse
Having avg(Value)>150
;

 * sqlite://
Done.

[(1, 162.5), (2, 162.5), (4, 165.0)]

In [31]:


%%sql

select Boxes.Code, Warehouses.Location from Boxes inner join Warehouses on  
Boxes.Warehouse = Warehouses.Code

 * sqlite://
Done.

[('0MN7', 'New York'),
 ('4H8P', 'Chicago'),
 ('4RT3', 'Los Angeles'),
 ('7G3H', 'Chicago'),
 ('8JN6', 'Chicago'),
 ('8Y6U', 'New York'),
 ('9J6F', 'Chicago'),
 ('LL08', 'Los Angeles'),
 ('P0H6', 'Chicago'),
 ('P2T6', 'Chicago'),
 ('TU55', 'San Francisco')]

In [35]:


%%sql 

select Boxes.Warehouse, Count(Warehouse) from Boxes 
Group by Boxes.Warehouse;

 * sqlite://
Done.

[(1, 4), (2, 2), (3, 2), (4, 2), (5, 1)]

In [36]:


%%sql

select Code
   FROM Warehouses
   where Capacity <
   (
     select COUNT(*)
       from Boxes
       where Warehouse = Warehouses.Code
   )

 * sqlite://
Done.

[(1,)]

In [39]:


%%sql 

select  Boxes.Code
   from  Warehouses left join Boxes
   ON Warehouses.Code = Boxes.Warehouse
   where Location = 'Chicago';

 * sqlite://
Done.

[('4H8P',), ('7G3H',), ('8JN6',), ('P0H6',), ('9J6F',), ('P2T6',)]

In [40]:
%%sql 

select  Code
   from  Boxes
   where  Warehouse IN
   (
     select Code
       from  Warehouses
       where Location = 'Chicago'
   );

 * sqlite://
Done.

[('4H8P',), ('7G3H',), ('8JN6',), ('9J6F',), ('P0H6',), ('P2T6',)]

In [42]:

%%sql
insert into Warehouses values(6, 'New York', 3)

 * sqlite://
1 rows affected.

[]

In [45]:
%%sql
select * from Warehouses;

 * sqlite://
Done.

[(1, 'Chicago', 3),
 (2, 'Chicago', 4),
 (3, 'New York', 7),
 (4, 'Los Angeles', 2),
 (5, 'San Francisco', 8),
 (6, 'New York', 3)]

In [47]:


%%sql

insert into Boxes values('H5RT', 'papers', 200, 2)

 * sqlite://
1 rows affected.

[]

In [50]:



%%sql
select * from Boxes ;

 * sqlite://
Done.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('8JN6', 'Papers', 75.0, 1),
 ('8Y6U', 'Papers', 50.0, 3),
 ('9J6F', 'Papers', 175.0, 2),
 ('LL08', 'Rocks', 140.0, 4),
 ('P0H6', 'Scissors', 125.0, 1),
 ('P2T6', 'Scissors', 150.0, 2),
 ('TU55', 'Papers', 90.0, 5),
 ('H5RT', 'papers', 200.0, 2)]

In [51]:


%%sql

update Boxes set 
value = Value * 0.85

 * sqlite://
12 rows affected.

[]

In [54]:


%%sql
select * from boxes ;

 * sqlite://
Done.

[('0MN7', 'Rocks', 153.0, 3),
 ('4H8P', 'Rocks', 212.5, 1),
 ('4RT3', 'Scissors', 161.5, 4),
 ('7G3H', 'Rocks', 170.0, 1),
 ('8JN6', 'Papers', 63.75, 1),
 ('8Y6U', 'Papers', 42.5, 3),
 ('9J6F', 'Papers', 148.75, 2),
 ('LL08', 'Rocks', 119.0, 4),
 ('P0H6', 'Scissors', 106.25, 1),
 ('P2T6', 'Scissors', 127.5, 2),
 ('TU55', 'Papers', 76.5, 5),
 ('H5RT', 'papers', 170.0, 2)]

In [ ]:


-- 3.16 Add Index for column "Warehouse" in table "boxes"
    -- !!!NOTE!!!: index should NOT be used on small tables in practice
-- 3.17 Print all the existing indexes
    -- !!!NOTE!!!: index should NOT be used on small tables in practice
-- 3.18 Remove (drop) the index you added just
    -- !!!NOTE!!!: index should NOT be used on small tables in practice

In [56]:


%%sql

DELETE FROM Boxes where Value< 100;

 * sqlite://
3 rows affected.

[]

In [57]:


%%sql 

delete from boxes
where warehouse in
(
select Code
   from Warehouses
   where Capacity <
   (
     select COUNT(*)
       from Boxes
       where Warehouse = Warehouses.Code
   )
);

 * sqlite://
0 rows affected.

[]

In [58]:
%%sql

CREATE INDEX INDEX_WAREHOUSE ON Boxes (warehouse);

 * sqlite://
Done.

[]

In [63]:
%%sql
select  * from SQLITE_MASTER where type = "index";

 * sqlite://
Done.

[('index', 'sqlite_autoindex_Boxes_1', 'Boxes', 4, None),
 ('index', 'INDEX_WAREHOUSE', 'Boxes', 5, 'CREATE INDEX INDEX_WAREHOUSE ON Boxes (warehouse)')]

In [64]:
%%sql

DROP INDEX INDEX_WAREHOUSE;

 * sqlite://
Done.

[]

In [65]:
%%sql
select  * from SQLITE_MASTER where type = "index";

 * sqlite://
Done.

[('index', 'sqlite_autoindex_Boxes_1', 'Boxes', 4, None)]